Revit 2024 API
StructuralAsset.YoungModulus Property
 The Young's modulus of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ YoungModulus { get; set; }
Visual Basic
Public Property YoungModulus As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ YoungModulus {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 This property cannot be used to set the Young's modulus for wood-based and isotropic materials. For such assets, use setYoungModulus instead. The value is in Newtons per foot meter (N/(ft · m)).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace